# Pandas data import
Ultimate guide to import data from various data sources into Pandas dataframe

In [1]:
# import libraries
import pandas as pd 
import numpy as np
from google.cloud import bigquery
import cx_Oracle as db

In [2]:
# data sources link
csv_current_dir = 'train.csv'
csv_another_dir = './Dataset/train.csv'
excel_another_dir = './Dataset/excel_data.xlsx'
feather_another_dir = './Dataset/feather_data.feather'
textfile_another_dir = './Dataset/textFile.txt'
hdf_another_dir = './Dataset/jet2.h5'
csv_from_url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
html_url = 'https://en.wikipedia.org/wiki/India'
html_file = './Dataset/table.html'
json_file = './Dataset/table.json'

In [3]:
# big query sql
query = """
SELECT
  weight_pounds,
  is_male,
  mother_age
FROM
  publicdata.samples.natality
WHERE year > 2000
LIMIT 5
"""

# oracle query
"""
select
    A3_7A3_7_SI_SENSOR_1,
    D1_01D1_01_ZAEHLER_01,
    DATUM 
from 
    tablename
"""

'\nselect\nA3_7A3_7_SI_SENSOR_1,D1_01D1_01_ZAEHLER_01,DATUM from tablename\n'

In [4]:
# reading data from current directory
df_import_current_dir = pd.read_csv(csv_current_dir)
df_import_current_dir.head()

         X1        X2        X3     TARGET
0  0.991066  1.462883  0.034695  10.543255
1  0.925121 -0.335997  0.261957  11.612457
2  0.501710  0.794581  0.445746   9.252304
3  0.933814 -0.580261  0.337145  12.352551
4  0.129216 -0.281915  0.036227   1.568255

In [5]:
# reading data from another directory
df_import_another_dir = pd.read_csv(csv_another_dir)
df_import_another_dir.head()

         X1        X2        X3     TARGET
0  0.991066  1.462883  0.034695  10.543255
1  0.925121 -0.335997  0.261957  11.612457
2  0.501710  0.794581  0.445746   9.252304
3  0.933814 -0.580261  0.337145  12.352551
4  0.129216 -0.281915  0.036227   1.568255

In [6]:
# reading data from url
df_import_url = pd.read_csv(csv_from_url)
df_import_url.head()

    Country  Region
0   Algeria  AFRICA
1    Angola  AFRICA
2     Benin  AFRICA
3  Botswana  AFRICA
4   Burkina  AFRICA

In [8]:
# copy the dataframe above and run this
df_clipboard = pd.read_clipboard()
df_clipboard.head()

    Country  Region
0   Algeria  AFRICA
1    Angola  AFRICA
2     Benin  AFRICA
3  Botswana  AFRICA
4   Burkina  AFRICA

In [9]:
# read data from excel file
# please make sure that xlrd package is installed
# if xlrd > 2.0.1 then also install openpyxl package
df_read_excel = pd.read_excel(excel_another_dir)
df_read_excel.head()

   A  B
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

In [10]:
# importing feather data
# feather data is a binary file format
# very high performance of reading and writing compared to read or writing csv
# feather data works for both R and Python

# first let's generate data

arr = np.random.randn(200, 4) # array with 800 elements
columnnames = ['col1','col2','col3','col4']
df = pd.DataFrame(arr, columns=columnnames)

# export data into dataset folder in feather format
df.to_feather(feather_another_dir)

In [11]:
# import feather data into pandas dataframe
df_feather = pd.read_feather(feather_another_dir)
df_feather.head()

       col1      col2      col3      col4
0 -0.006778 -1.665707  0.664247 -0.068092
1  0.124316  2.207284  1.308837 -0.053956
2  0.473819 -0.466810  1.081742 -0.133779
3 -0.268494 -1.285698 -0.313816  1.117697
4  2.478739  0.364139 -1.483501 -1.227362

In [12]:
# Reading a table of fixed-width formatted lines into Pandas
df_textfile = pd.read_fwf(textfile_another_dir,skiprows=[0,1,2], skipfooter = 2, widths=[8,12,19])
df_textfile

      name        title               salary
0    Rahul    Side kick                 -100
1  Ironman     Rich Guy  1000000000000000000
2  Captain  Respect Guy      100000000000000
3     Hulk    Smash bro     1000000000000000

In [13]:
# install gcloud sdk
# install bigquery client
# authenticate yoursellf through cli
# importing data from big query
# Returns data in pandas dataframe format
df_gcp = bigquery.Client().query(query).to_dataframe();
df_gcp.head()

   weight_pounds  is_male  mother_age
0       7.568469     True          22
1       8.807467     True          39
2       8.313632     True          23
3       8.000575    False          27
4       6.563162    False          29

In [14]:
# creating heirarichal data file hdf
# this requires you to install tables
df_create_hdf = pd.DataFrame([[1, 1.0, 'a']], columns=['x', 'y', 'z'])
df_create_hdf.to_hdf(hdf_another_dir, 'data')

#read data
df_hdf = pd.read_hdf(hdf_another_dir)
df_hdf.head()

   x    y  z
0  1  1.0  a

In [15]:
# the most powerfull 
# reading from html file
# returns list
df_html_file = pd.DataFrame(pd.read_html(html_file)[0])
df_html_file.head()

  Firstname Lastname  Age
0     Rahul   Pandey   33
1      Iron      Man   48
2   Captain  America   39
3       The     Hulk   49

In [16]:
# fetching data from html webpages 
# returns list
df_html_url = pd.DataFrame(pd.read_html(html_url)[18])
df_html_url.head()

                0                                                  1
0       Australia  Ashmore and Cartier Islands Australian Antarct...
1     New Zealand          Cook Islands Niue Ross Dependency Tokelau
2  United Kingdom  Akrotiri and Dhekelia Anguilla Bermuda British...

In [17]:
#creating json file
df_revengers = pd.DataFrame([['rahul', 'pandey'], ['iron', 'man'], ['captain', 'america'], ['the', 'hulk']],
                  index=['0', '1', '2', '3'],
                  columns=['firstname', 'lastname'])
df_revengers.to_json(json_file, orient='split')

In [18]:
#fetching data from json
df_json = pd.read_json(json_file, orient='split')
df_json.head()

  firstname lastname
0     rahul   pandey
1      iron      man
2   captain  america
3       the     hulk

In [ ]:
#DB connection credentials
connstr='username/password@source'
conn = db.connect(connstr)
curs = conn.cursor()

#Datalogger connection
curs.execute()

#Data into pandas
df_from_db = pd.DataFrame(curs.fetchall())
col_names = [row[0] for row in curs.description]
df_from_db.columns = col_names
curs.close()

#Show data
df_from_db.head(n=10)